InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Перем уид1, уид2;

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчикОжидания",0.2,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		возврат
	КонецЕсли;
	
	АдресКартинки = ИА_КСУОбщийСервер.ОбновитьИзображение(ТекущаяСтрока.ФизЛицо,,уид1);
	АдресКартинкиАватар = ИА_КСУОбщийСервер.ОбновитьИзображение(ТекущаяСтрока.ФизЛицо, "Аватар",уид2);
	
КонецПроцедуры



&НаКлиенте
Процедура ФотоФизЛицаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка =Ложь;
	ДобавитьИзображение(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(ТекущийЭлемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	ДополнительныеПараметры = Новый Структура("ТекущаяСтрока", ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("Аватар", ТекущийЭлемент = Элементы.ФотоФизЛицаАватар);
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьИзображениеЗавершение", ЭтаФорма, ДополнительныеПараметры);
	НачатьПомещениеФайла(Оповещение,,, Истина, УникальныйИдентификатор);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеЗавершение(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		ЗаписатьФотоВРегистр(ДополнительныеПараметры.ТекущаяСтрока.ФизЛицо, Адрес, ДополнительныеПараметры.Аватар);
		Если ДополнительныеПараметры.Аватар Тогда
			ИА_КСУОбщийСервер.ОбновитьАватар(ДополнительныеПараметры.ТекущаяСтрока.ФизЛицо, истина);
		Иначе 
			дп = Новый Структура("ФизЛицо", ДополнительныеПараметры.ТекущаяСтрока.ФизЛицо);
			ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеЗавершениеЗавершение", ЭтотОбъект, дп), "Обновить аватар?",РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
		СписокПриАктивизацииСтрокиОбработчикОжидания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеЗавершениеЗавершение(РезультатВопроса, ДополнительныеПараметры1) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИА_КСУОбщийСервер.ОбновитьАватар(ДополнительныеПараметры1.ФизЛицо);
		АдресКартинки = ИА_КСУОбщийСервер.ОбновитьИзображение(ДополнительныеПараметры1.ФизЛицо,,уид1);
		АдресКартинкиАватар = ИА_КСУОбщийСервер.ОбновитьИзображение(ДополнительныеПараметры1.ФизЛицо, "Аватар",уид2);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФизЛица(Команда)
	
	ФормаПодбора = ПолучитьФорму("РегистрСведений.ИА_ДанныеФизЛиц.Форма.ФормаПодбораФизическихЛиц", , ЭтаФорма, УникальныйИдентификатор);
	ФормаПодбора.Открыть();
	
	ЗаполнитьФизЛицаНаСервере();
	СписокПриАктивизацииСтрокиОбработчикОжидания();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФизЛицаНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПользователей(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПользователейЗавершение", ЭтаФорма), "Пользователи будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПользователейЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПользователейНаСервере();
		СписокПриАктивизацииСтрокиОбработчикОжидания();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФото(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьФотоЗавершение", ЭтаФорма), "Фотографии будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФотоЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьФотоНаСервере();
		СписокПриАктивизацииСтрокиОбработчикОжидания();
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПользователейНаСервере()
	
	имяРекв = "";
	
	Если Метаданные.Справочники.Пользователи.Реквизиты.Найти("ФизЛицо") <> Неопределено Тогда
		имяРекв = "ФизЛицо";
	ИначеЕсли Метаданные.Справочники.Пользователи.Реквизиты.Найти("ФизическоеЛицо") <> Неопределено Тогда
		имяРекв = "ФизическоеЛицо";
	КонецЕсли;
	
	Если имяРекв <> ""  Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|	Пользователи."+имяРекв+" КАК ФизЛицо
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ФизЛицо      = ВыборкаДетальныеЗаписи.ФизЛицо;
			Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
			
			Если ЗначениеЗаполнено(ФизЛицо) И ЗначениеЗаполнено(Пользователь) Тогда
				
				ЗаписатьПользователяВРегистр(ФизЛицо, Пользователь)
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В справочнике Пользователи не найден реквизит ФизЛицо.";
		Сообщение.Сообщить();

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьФотоВРегистр(ФизЛицо, АдресФото, ЭтоАватар = ложь)
	
	Если ТипЗнч(АдресФото) = Тип("ХранилищеЗначения") Тогда
		Фото = АдресФото.Получить();
	ИначеЕсли  ЭтоАдресВременногоХранилища(АдресФото) Тогда
		Фото = ПолучитьИзВременногоХранилища(АдресФото);
	Иначе
		Фото = АдресФото;
	КонецЕсли;
	
	
	Если не ЭтоАватар Тогда
    	Данные = ИА_КСУОбщийСервер.Картинки_ИзменитьРазмер(Фото, 220, 220, 0.75);
	
		Если Данные.Выполнено Тогда
			Фото = Данные.ДДКартинки;
		КонецЕсли;
	КонецЕсли;
	
	Менедж = РегистрыСведений.ИА_ДанныеФизЛиц.СоздатьМенеджерЗаписи();
	Менедж.ФизЛицо = ФизЛицо;	
	Менедж.Прочитать();
	Если ЭтоАватар Тогда
		Менедж.ФотоАватар = Новый ХранилищеЗначения(Фото);
	Иначе
		Менедж.Фото = Новый ХранилищеЗначения(Фото);
	КонецЕсли;
	Менедж.Записать();
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьПользователяВРегистр(ФизЛицо, Пользователь)
	
	НаборЗаписей = РегистрыСведений.ИА_ДанныеФизЛиц.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.ФизЛицо.Установить(ФизЛицо);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ФизЛицо = ФизЛицо;
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей[0];
		
	КонецЕсли; 
	
	Если ЗаписьНабора.Пользователь <> Пользователь Тогда
		
		ЗаписьНабора.Пользователь = Пользователь;
		НаборЗаписей.Записать();
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФотоНаСервере()
	
	Если Метаданные.Справочники.ФизическиеЛица.Реквизиты.Найти("ОсновноеИзображение") <> Неопределено  Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ДанныеФизЛиц.ФизЛицо,
		|	ФизическиеЛица.ОсновноеИзображение
		|ИЗ
		|	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ИА_ДанныеФизЛиц.ФизЛицо = ФизическиеЛица.Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ФизЛицо             = ВыборкаДетальныеЗаписи.ФизЛицо;
			ОсновноеИзображение = ВыборкаДетальныеЗаписи.ОсновноеИзображение;

			Если ЗначениеЗаполнено(ФизЛицо) И ЗначениеЗаполнено(ОсновноеИзображение) Тогда
				 ЗаписатьФотоВРегистр(ФизЛицо, ОсновноеИзображение.Хранилище)
			 КонецЕсли;
			 
		 КонецЦикла;
	 Иначе
		 
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "В справочнике Физические лица не найден реквизит ОсновноеИзображение";
		 Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уид1 = новый УникальныйИдентификатор;
	уид2 = новый УникальныйИдентификатор;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытиеФормыФЛ_КЦ" Тогда
		СписокПриАктивизацииСтрокиОбработчикОжидания();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьАватарыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ДанныеФизЛиц.ФизЛицо
	               |ИЗ
	               |	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИА_КСУОбщийСервер.ОбновитьАватар(Выборка.ФизЛицо);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАватарЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАватарыНаСервере();
		СписокПриАктивизацииСтрокиОбработчикОжидания();	
		ПоказатьПредупреждение(,"Выполнено");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАватары(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьАватарЗавершение", ЭтаФорма), "Аватары будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТелефонИПочтуИзФизЛицаНаСервере()
	ПутьКДанным = "";
	ПолеСвязи = "";
	Попытка
		сс = Справочники["ФизическиеЛица"].ПустаяСсылка()["КонтактнаяИнформация"].Ссылка;
		ПутьКДанным = "Справочник.ФизическиеЛица.КонтактнаяИнформация";
		ПолеСвязи = "Ссылка";
	Исключение
		Попытка
			м = РегистрыСведений["КонтактнаяИнформация"].СоздатьМенеджерЗаписи();
			ПутьКДанным = "РегистрСведений.КонтактнаяИнформация";
			ПолеСвязи = "Объект";
		Исключение
		КонецПопытки;
	КонецПопытки;
	
	Если ПутьКДанным = "" Тогда
		Сообщить("Невозможно определить источник для заполнения.");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ДанныеФизЛиц.ФизЛицо,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(100))) КАК Телефон,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация1.Представление, """") КАК СТРОКА(100))) КАК Почта
	               |ИЗ
	               |	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО ИА_ДанныеФизЛиц.ФизЛицо = КонтактнаяИнформация.Объект
	               |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация1
	               |		ПО ИА_ДанныеФизЛиц.ФизЛицо = КонтактнаяИнформация1.Объект
	               |			И (КонтактнаяИнформация1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |ГДЕ
	               |	(НЕ КонтактнаяИнформация.Представление ЕСТЬ NULL 
	               |			ИЛИ НЕ КонтактнаяИнформация1.Представление ЕСТЬ NULL )
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ДанныеФизЛиц.ФизЛицо";
				   
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.КонтактнаяИнформация", ПутьКДанным); 
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Объект", ПолеСвязи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мен = РегистрыСведений.ИА_ДанныеФизЛиц.СоздатьМенеджерЗаписи();
		мен.ФизЛицо = Выборка.ФизЛицо;
		мен.Прочитать();
		
		мен.ЭлектроннаяПочта = Выборка.Почта;
		мен.Телефон = Выборка.Телефон;
		
		мен.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТелефонИПочтуИзФизЛица(Команда)
	ЗаполнитьТелефонИПочтуИзФизЛицаНаСервере();
	
	Элементы.Список.Обновить();
КонецПроцедуры
